## Pandas

* Pandas is used to analyse data & big data and make conclusion based on 
  statistical theories.
  
* Pandas is typically used to clean messy data & make them readable & simple to
  access.
  
* It cal also help us in finding relationship between columns (co-relation)

* It can also be used in doing all statistical methodologies as well as plotting 
  and creating graphs.

In [1]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.2.4'

### Series

* A series is a 1-Dimensional array like object, containing a sequence of values
  (of similar data types) and an associated array of data labels called as indexes.

In [4]:
obj = pd.Series([10,20,30,40])

In [5]:
obj

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
import numpy as np

arr = np.array([10,20,30,40])

In [7]:
arr

array([10, 20, 30, 40])

In [8]:
# defining your own keys

obj2 = pd.Series([10,20,30,40],index=['d','b','a','c'])

In [9]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [10]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [11]:
obj

0    10
1    20
2    30
3    40
dtype: int64

In [12]:
obj[2]

30

In [13]:
obj[3]

40

In [14]:
obj[3] = 100

In [15]:
obj

0     10
1     20
2     30
3    100
dtype: int64

In [16]:
obj[0:3] = 4332

In [17]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [18]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [19]:
obj2['a']

30

In [20]:
obj2[2]

30

In [21]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [22]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [24]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [25]:
obj[[0,2,3]]

0    4332
2    4332
3     100
dtype: int64

In [26]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [27]:
obj2[['d','c']]

d    10
c    40
dtype: int64

In [28]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [29]:
obj2 > 20

d    False
b    False
a     True
c     True
dtype: bool

In [30]:
res = obj2[obj2 > 20]

In [31]:
res

a    30
c    40
dtype: int64

In [32]:
type(res)

pandas.core.series.Series

In [33]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [34]:
obj2+5

d    15
b    25
a    35
c    45
dtype: int64

In [35]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [36]:
obj2 - 2

d     8
b    18
a    28
c    38
dtype: int64

In [37]:
obj2 * 2

d    20
b    40
a    60
c    80
dtype: int64

In [38]:
obj2 / 2

d     5.0
b    10.0
a    15.0
c    20.0
dtype: float64

## creating series from python dictionary

In [39]:
data = {
    'Mumbai':1000,
    'Delhi':7500,
    'Nagpur':5000,
    'Chennai':3212
}

In [40]:
data

{'Mumbai': 1000, 'Delhi': 7500, 'Nagpur': 5000, 'Chennai': 3212}

In [41]:
obj4 = pd.Series(data)

In [42]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [43]:
data_2 = {
    'city':['Mumbai','Pune','Chennai'],
    'salary':[3500,4500,6000]
}

In [44]:
data_2

{'city': ['Mumbai', 'Pune', 'Chennai'], 'salary': [3500, 4500, 6000]}

In [45]:
obj5 = pd.Series(data_2)

In [46]:
obj5

city      [Mumbai, Pune, Chennai]
salary         [3500, 4500, 6000]
dtype: object

In [47]:
type(obj5['city'])

list

In [48]:
type(obj5)

pandas.core.series.Series

In [49]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [50]:
data

{'Mumbai': 1000, 'Delhi': 7500, 'Nagpur': 5000, 'Chennai': 3212}

In [51]:
cities = ['Mumbai','Delhi','Nagpur','Chennai','Ahmedabad']

In [52]:
obj5 = pd.Series(data,index=cities)

In [53]:
obj5

Mumbai       1000.0
Delhi        7500.0
Nagpur       5000.0
Chennai      3212.0
Ahmedabad       NaN
dtype: float64

In [54]:
pd.isnull(obj5)

Mumbai       False
Delhi        False
Nagpur       False
Chennai      False
Ahmedabad     True
dtype: bool

In [55]:
pd.notnull(obj5)

Mumbai        True
Delhi         True
Nagpur        True
Chennai       True
Ahmedabad    False
dtype: bool

In [56]:
obj5[pd.notnull(obj5)]

Mumbai     1000.0
Delhi      7500.0
Nagpur     5000.0
Chennai    3212.0
dtype: float64

In [57]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [58]:
obj5

Mumbai       1000.0
Delhi        7500.0
Nagpur       5000.0
Chennai      3212.0
Ahmedabad       NaN
dtype: float64

In [59]:
obj4+obj5

Ahmedabad        NaN
Chennai       6424.0
Delhi        15000.0
Mumbai        2000.0
Nagpur       10000.0
dtype: float64

In [60]:
ser1 = pd.Series(20,index=['chennai'])

In [61]:
ser2 = pd.Series(40,index=['Chennai'])

In [62]:
ser1

chennai    20
dtype: int64

In [63]:
ser2

Chennai    40
dtype: int64

In [64]:
ser1+ser2

Chennai   NaN
chennai   NaN
dtype: float64

### DataFrames

* A dataframe represents a rectangular table of data & contains 
  ordered collection of columns which can be of a different data type


* The DataFrame has both row & column index, it can be thought
  as a dictionary of series, all sharing the same index.
  
  
  
* The data is stored as one or more 2-D block.

<img src="https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png" width=300px; height=300px;>

In [65]:
data_1 = {
    'State':['Mumbai','Pune','Chennai','Delhi','Nagpur'],
    'year':[2001,2011,2018,2019,2020],
    'pop':[1.5,1.7,3.6,2.4,3.2]
}

In [66]:
data_1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'pop': [1.5, 1.7, 3.6, 2.4, 3.2]}

In [67]:
pd.Series(data_1)

State    [Mumbai, Pune, Chennai, Delhi, Nagpur]
year             [2001, 2011, 2018, 2019, 2020]
pop                   [1.5, 1.7, 3.6, 2.4, 3.2]
dtype: object

In [68]:
df = pd.DataFrame(data_1)

In [69]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [70]:
df.style.set_table_styles(
[{'selector':'tr:hover',
  'props':[('background-color','yellow')]
 }]
)

In [71]:
df.head()

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [72]:
df.head(3)

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6

In [73]:
df.tail(2)

    State  year  pop
3   Delhi  2019  2.4
4  Nagpur  2020  3.2

In [74]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [75]:
data_1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'pop': [1.5, 1.7, 3.6, 2.4, 3.2]}

In [76]:
df2 = pd.DataFrame(data_1,columns=['State','year','pop','debt'],
                  index=['one','two','three','four','five'])

In [77]:
df2

         State  year  pop debt
one     Mumbai  2001  1.5  NaN
two       Pune  2011  1.7  NaN
three  Chennai  2018  3.6  NaN
four     Delhi  2019  2.4  NaN
five    Nagpur  2020  3.2  NaN

In [78]:
df2.columns

Index(['State', 'year', 'pop', 'debt'], dtype='object')

In [79]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [80]:
df2.columns = ['STATE','YEAR','POP','DEBT']

In [81]:
df2

         STATE  YEAR  POP DEBT
one     Mumbai  2001  1.5  NaN
two       Pune  2011  1.7  NaN
three  Chennai  2018  3.6  NaN
four     Delhi  2019  2.4  NaN
five    Nagpur  2020  3.2  NaN

In [82]:
df2['STATE']  #fetching the data column wise

one       Mumbai
two         Pune
three    Chennai
four       Delhi
five      Nagpur
Name: STATE, dtype: object

In [83]:
type(df2['STATE'])

pandas.core.series.Series

In [84]:
df2[['STATE','POP']]   #fetching multiple columns

         STATE  POP
one     Mumbai  1.5
two       Pune  1.7
three  Chennai  3.6
four     Delhi  2.4
five    Nagpur  3.2

In [85]:
df2['DEBT']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
Name: DEBT, dtype: object

In [86]:
df2['DEBT'] = 16

In [87]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5    16
two       Pune  2011  1.7    16
three  Chennai  2018  3.6    16
four     Delhi  2019  2.4    16
five    Nagpur  2020  3.2    16

In [88]:
df2['DEBT'] = np.arange(1,6)

In [89]:
df2['DEBT']

one      1
two      2
three    3
four     4
five     5
Name: DEBT, dtype: int64

In [90]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
two       Pune  2011  1.7     2
three  Chennai  2018  3.6     3
four     Delhi  2019  2.4     4
five    Nagpur  2020  3.2     5

In [91]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
two       Pune  2011  1.7     2
three  Chennai  2018  3.6     3
four     Delhi  2019  2.4     4
five    Nagpur  2020  3.2     5

In [92]:
df2.loc['three']

STATE    Chennai
YEAR        2018
POP          3.6
DEBT           3
Name: three, dtype: object

In [93]:
type(df2.loc['three'])

pandas.core.series.Series

In [94]:
df2.loc[['one','five']]  #fetching multiple rows

       STATE  YEAR  POP  DEBT
one   Mumbai  2001  1.5     1
five  Nagpur  2020  3.2     5

In [95]:
df2.iloc[0]  #fetching row wise data on basis of default index value

STATE    Mumbai
YEAR       2001
POP         1.5
DEBT          1
Name: one, dtype: object

In [96]:
df2.iloc[[0,2]]

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
three  Chennai  2018  3.6     3

In [97]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [98]:
df['Western'] = df['State'] == 'Mumbai'

In [99]:
df

     State  year  pop  Western
0   Mumbai  2001  1.5     True
1     Pune  2011  1.7    False
2  Chennai  2018  3.6    False
3    Delhi  2019  2.4    False
4   Nagpur  2020  3.2    False

In [100]:
del df['Western']

In [101]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

### index objects

In [102]:
obj = pd.Series(range(3),index=['a','b','c'])

In [103]:
obj

a    0
b    1
c    2
dtype: int64

In [104]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [105]:
my_index = obj.index

In [106]:
my_index

Index(['a', 'b', 'c'], dtype='object')

In [107]:
my_index[0]

'a'

In [108]:
my_index[1]

'b'

In [111]:
my_index[0]

'a'

In [112]:
my_index[0] = 'D'

TypeError: Index does not support mutable operations

In [113]:
obj1 = pd.Series([4.1,7.5,-8.3,3.6],index=['d','a','b','c'])

In [114]:
obj1

d    4.1
a    7.5
b   -8.3
c    3.6
dtype: float64

In [115]:
obj1 = obj1.reindex(['a','b','c','d'])

In [116]:
obj1

a    7.5
b   -8.3
c    3.6
d    4.1
dtype: float64

In [117]:
obj3 = pd.Series(['blue','purple','red'],index=[0,2,4])

In [118]:
obj3

0      blue
2    purple
4       red
dtype: object

In [121]:
obj4 = obj3.reindex(range(7),method='ffill')

In [122]:
obj4

0      blue
1      blue
2    purple
3    purple
4       red
5       red
6       red
dtype: object

In [123]:
obj5 = obj3.reindex(range(6),method='bfill')

In [124]:
obj5

0      blue
1    purple
2    purple
3       red
4       red
5       NaN
dtype: object

## dropping entries in series

In [125]:
obj6 = pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [126]:
obj6

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [127]:
obj6.drop('c')

a    0
b    1
d    3
e    4
dtype: int64

In [128]:
obj6

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [129]:
obj6.drop(['a','d'])

b    1
c    2
e    4
dtype: int64

In [130]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['Mumbai','Pune','Chennai','Delhi'],
                   columns=['one','two','three','four'])

In [131]:
data

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [132]:
data.drop(['Pune','Chennai'])

        one  two  three  four
Mumbai    0    1      2     3
Delhi    12   13     14    15

In [133]:
data

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [134]:
data

         one  two  three  four
Mumbai     0    1      2     3
Pune       4    5      6     7
Chennai    8    9     10    11
Delhi     12   13     14    15

In [135]:
#to drop a column in data frame

data.drop('three',axis=1)

         one  two  four
Mumbai     0    1     3
Pune       4    5     7
Chennai    8    9    11
Delhi     12   13    15

In [136]:
data.drop(['one','four'],axis=1)

         two  three
Mumbai     1      2
Pune       5      6
Chennai    9     10
Delhi     13     14

In [137]:
#to drop a column in data frame

data.drop('three',axis=1,inplace=True)

In [138]:
data

         one  two  four
Mumbai     0    1     3
Pune       4    5     7
Chennai    8    9    11
Delhi     12   13    15

In [139]:
df3 = pd.DataFrame(np.arange(9).reshape(3,3),
                  columns=['b','c','d'],
                  index=['Mumbai','Pune','Nagpur'])

In [140]:
df3

        b  c  d
Mumbai  0  1  2
Pune    3  4  5
Nagpur  6  7  8

In [141]:
df4 = pd.DataFrame(np.arange(12).reshape(4,3),
                  columns=['b','d','e'],
                  index=['Delhi','Mumbai','Pune','Chennai'])

In [142]:
df4

         b   d   e
Delhi    0   1   2
Mumbai   3   4   5
Pune     6   7   8
Chennai  9  10  11

In [146]:
df6  = df3+df4

In [145]:
df3.add(df4,fill_value=0)

           b    c     d     e
Chennai  9.0  NaN  10.0  11.0
Delhi    0.0  NaN   1.0   2.0
Mumbai   3.0  1.0   6.0   5.0
Nagpur   6.0  7.0   8.0   NaN
Pune     9.0  4.0  12.0   8.0

In [148]:
df6.fillna(0)

           b    c     d    e
Chennai  0.0  0.0   0.0  0.0
Delhi    0.0  0.0   0.0  0.0
Mumbai   3.0  0.0   6.0  0.0
Nagpur   0.0  0.0   0.0  0.0
Pune     9.0  0.0  12.0  0.0

In [149]:
df6

           b   c     d   e
Chennai  NaN NaN   NaN NaN
Delhi    NaN NaN   NaN NaN
Mumbai   3.0 NaN   6.0 NaN
Nagpur   NaN NaN   NaN NaN
Pune     9.0 NaN  12.0 NaN

## functions & mapping

In [150]:
df1 = pd.DataFrame(np.random.randn(4,3),
                  columns=['b','d','e'],
                  index=['Mumbai','Chennai','Delhi','Nagpur'])

In [151]:
df1

                b         d         e
Mumbai   1.103642 -0.063557  1.463831
Chennai  0.021173  0.896067  0.017327
Delhi   -1.189485  0.663739 -0.163285
Nagpur  -0.023331  0.639016  0.375389

In [153]:
df1['b'].min()

-1.1894851988076753

In [154]:
df1['b'].max()

1.1036423516438962

In [155]:
difference = lambda x:x.max() - x.min()

In [156]:
difference

In [169]:
ser = df1.apply(difference,axis=0)  #col wise

In [170]:
ser

b             2.293128
d             0.959624
e             1.627116
difference    1.190877
dtype: float64

In [158]:
df1

                b         d         e
Mumbai   1.103642 -0.063557  1.463831
Chennai  0.021173  0.896067  0.017327
Delhi   -1.189485  0.663739 -0.163285
Nagpur  -0.023331  0.639016  0.375389

In [160]:
type(df1['b'])

pandas.core.series.Series

In [161]:
df1.apply(difference,axis=1) #row wise

Mumbai     1.527388
Chennai    0.878741
Delhi      1.853224
Nagpur     0.662347
dtype: float64

In [163]:
df1['difference'] = df1.apply(difference,axis=1) #row wise

In [164]:
df1

                b         d         e  difference
Mumbai   1.103642 -0.063557  1.463831    1.527388
Chennai  0.021173  0.896067  0.017327    0.878741
Delhi   -1.189485  0.663739 -0.163285    1.853224
Nagpur  -0.023331  0.639016  0.375389    0.662347

In [168]:
df1.append(ser,ignore_index=True)

          b         d         e  difference
0  1.103642 -0.063557  1.463831    1.527388
1  0.021173  0.896067  0.017327    0.878741
2 -1.189485  0.663739 -0.163285    1.853224
3 -0.023331  0.639016  0.375389    0.662347
4  2.293128  0.959624  1.627116    1.190877

In [171]:
df1

                b         d         e  difference
Mumbai   1.103642 -0.063557  1.463831    1.527388
Chennai  0.021173  0.896067  0.017327    0.878741
Delhi   -1.189485  0.663739 -0.163285    1.853224
Nagpur  -0.023331  0.639016  0.375389    0.662347

In [172]:
df1['difference']

Mumbai     1.527388
Chennai    0.878741
Delhi      1.853224
Nagpur     0.662347
Name: difference, dtype: float64

In [178]:
round1 = lambda x : "{:.2f}".format(x)

In [179]:
df1['difference'].apply(round1)

Mumbai     1.53
Chennai    0.88
Delhi      1.85
Nagpur     0.66
Name: difference, dtype: object

In [194]:
round2 = lambda x :round(x,2)

In [198]:
round2(12.44,2)

TypeError: <lambda>() takes 1 positional argument but 2 were given

In [2]:
import numpy as np
import pandas as pd

In [3]:

name = pd.Series([
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Benjamin Duran',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Safila Hatfield',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle',
    'Toni Doyle'

])


class_ = pd.Series([
    'A',
    'A',
    'A',
    'A',
    'A',
    'A',
    'B',
    'B',
    'B',
    'B',
    'B',
    'B',
    'C',
    'C',
    'C',
    'C',
    'C',
    'C'
])

Lectures = pd.Series([
    'Maths',
    'Chemistry',
    'Physics',
    'History',
    'Geography',
    'Science',
    'Maths',
    'Chemistry',
    'Physics',
    'History',
    'Geography',
    'Science',
    'Maths',
    'Chemistry',
    'Physics',
    'History',
    'Geography',
    'Science'
])

Grades = pd.Series([
    90,
    54,
    77,
    22,
    25,
    70,
    90,
    90,
    90,
    45,
    90,
    90,
    70,
    44,
    56,
    77,
    35,
    99
])


Credits = pd.Series([
    6,6,6,5,5,4,6,6,6,5,5,4,6,6,6,5,5,4
])

retake = pd.Series([
    'No','No','No','Yes','Yes','No','No','No','No','No','No','No','No','Yes','No','No','Yes','No'
])

In [9]:
retake

0      No
1      No
2      No
3     Yes
4     Yes
5      No
6      No
7      No
8      No
9      No
10     No
11     No
12     No
13    Yes
14     No
15     No
16    Yes
17     No
dtype: object

In [13]:
df = pd.DataFrame({
    "name":name,
    "class":class_,
    "lectures":Lectures,
    "grades":Grades,
    "credits":Credits,
    "retake":retake
})

In [14]:
df

               name class   lectures  grades  credits retake
0    Benjamin Duran     A      Maths      90        6     No
1    Benjamin Duran     A  Chemistry      54        6     No
2    Benjamin Duran     A    Physics      77        6     No
3    Benjamin Duran     A    History      22        5    Yes
4    Benjamin Duran     A  Geography      25        5    Yes
5    Benjamin Duran     A    Science      70        4     No
6   Safila Hatfield     B      Maths      90        6     No
7   Safila Hatfield     B  Chemistry      90        6     No
8   Safila Hatfield     B    Physics      90        6     No
9   Safila Hatfield     B    History      45        5     No
10  Safila Hatfield     B  Geography      90        5     No
11  Safila Hatfield     B    Science      90        4     No
12       Toni Doyle     C      Maths      70        6     No
13       Toni Doyle     C  Chemistry      44        6    Yes
14       Toni Doyle     C    Physics      56        6     No
15       Toni Doyle     C    History      77        5     No
16       Toni Doyle     C  Geography      35        5    Yes
17       Toni Doyle     C    Science      99        4     No

In [15]:
def class_allocation(data):
    if data >=75 and data <=100:
        return "Distinction Class"
    elif data >=60 and data <75:
        return "First Class"
    elif data >=45 and data <60:
        return "Second Class"
    elif data >=35 and data < 45:
        return "Pass Class"
    else:
        return "Fail"

In [17]:
df['classType'] = df['grades'].apply(class_allocation)

In [18]:
df

,name,class,lectures,grades,credits,retake,classType
0,Benjamin Duran,A,Maths,90,6,No,Distinction Class
1,Benjamin Duran,A,Chemistry,54,6,No,Second Class
2,Benjamin Duran,A,Physics,77,6,No,Distinction Class
3,Benjamin Duran,A,History,22,5,Yes,Fail
4,Benjamin Duran,A,Geography,25,5,Yes,Fail
5,Benjamin Duran,A,Science,70,4,No,First Class
6,Safila Hatfield,B,Maths,90,6,No,Distinction Class
7,Safila Hatfield,B,Chemistry,90,6,No,Distinction Class
8,Safila Hatfield,B,Physics,90,6,No,Distinction Class
9,Safila Hatfield,B,History,45,5,No,Second Class
10,Safila Hatfield,B,Geography,90,5,No,Distinction Class
11,Safila Hatfield,B,Science,90,4,No,Distinction Class
12,Toni Doyle,C,Maths,70,6,No,First Class
13,Toni Doyle,C,Chemistry,44,6,Yes,Pass Class
14,Toni Doyle,C,Physics,56,6,No,Second Class
15,Toni Doyle,C,History,77,5,No,Distinction Class
16,Toni Doyle,C,Geography,35,5,Yes,Pass Class
17,Toni Doyle,C,Science,99,4,No,Distinction Class

In [25]:
def last_name_func(data):
    fname = data.split(' ')
    return fname[1]

In [26]:
df['LastName'] = df['name'].apply(last_name_func)

In [27]:
df

,name,class,lectures,grades,credits,retake,classType,FirstName,LastName
0,Benjamin Duran,A,Maths,90,6,No,Distinction Class,Benjamin,Duran
1,Benjamin Duran,A,Chemistry,54,6,No,Second Class,Benjamin,Duran
2,Benjamin Duran,A,Physics,77,6,No,Distinction Class,Benjamin,Duran
3,Benjamin Duran,A,History,22,5,Yes,Fail,Benjamin,Duran
4,Benjamin Duran,A,Geography,25,5,Yes,Fail,Benjamin,Duran
5,Benjamin Duran,A,Science,70,4,No,First Class,Benjamin,Duran
6,Safila Hatfield,B,Maths,90,6,No,Distinction Class,Safila,Hatfield
7,Safila Hatfield,B,Chemistry,90,6,No,Distinction Class,Safila,Hatfield
8,Safila Hatfield,B,Physics,90,6,No,Distinction Class,Safila,Hatfield
9,Safila Hatfield,B,History,45,5,No,Second Class,Safila,Hatfield
10,Safila Hatfield,B,Geography,90,5,No,Distinction Class,Safila,Hatfield
11,Safila Hatfield,B,Science,90,4,No,Distinction Class,Safila,Hatfield
12,Toni Doyle,C,Maths,70,6,No,First Class,Toni,Doyle
13,Toni Doyle,C,Chemistry,44,6,Yes,Pass Class,Toni,Doyle
14,Toni Doyle,C,Physics,56,6,No,Second Class,Toni,Doyle
15,Toni Doyle,C,History,77,5,No,Distinction Class,Toni,Doyle
16,Toni Doyle,C,Geography,35,5,Yes,Pass Class,Toni,Doyle
17,Toni Doyle,C,Science,99,4,No,Distinction Class,Toni,Doyle

## Group by

In [28]:
data = {
    'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person' :['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
    'Sales':[200,120,340,124,243,350]
}

In [29]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [32]:
df1 = pd.DataFrame(data)

In [33]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [35]:
grp_data = df1.groupby('Company')

In [36]:
grp_data.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [37]:
grp_data.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [38]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [39]:
grp_data.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [79]:
compnay_grp = grp_data.count()

In [47]:
new_data = grp_data.describe()

In [72]:
res1 = new_data.reset_index()

In [73]:
res1 = res.transpose()

In [67]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [71]:
res

  Company Sales
          count   mean         std    min     25%    50%     75%    max
0      FB   2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
1    GOOG   2.0  160.0   56.568542  120.0   140.0  160.0   180.0  200.0
2    MSFT   2.0  232.0  152.735065  124.0   178.0  232.0   286.0  340.0

In [76]:
res1[1]

Company                GOOG
Sales    count          2.0
         mean         160.0
         std      56.568542
         min          120.0
         25%          140.0
         50%          160.0
         75%          180.0
         max          200.0
Name: 1, dtype: object

In [77]:
res1

                       0          1           2
Company               FB       GOOG        MSFT
Sales   count        2.0        2.0         2.0
        mean       296.5      160.0       232.0
        std    75.660426  56.568542  152.735065
        min        243.0      120.0       124.0
        25%       269.75      140.0       178.0
        50%        296.5      160.0       232.0
        75%       323.25      180.0       286.0
        max        350.0      200.0       340.0

In [78]:
res1[2]

Company                 MSFT
Sales    count           2.0
         mean          232.0
         std      152.735065
         min           124.0
         25%           178.0
         50%           232.0
         75%           286.0
         max           340.0
Name: 2, dtype: object

In [80]:
compnay_grp.columns

Index(['Person', 'Sales'], dtype='object')

In [82]:
df1[df1['Company'] == 'GOOG']

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120

In [88]:
goog = df1.groupby(df1['Company'] == 'GOOG')

In [85]:
goog.mean()

          Sales
Company
False    264.25
True     160.00

In [94]:
google = df1[df1['Company'] == 'GOOG']

In [95]:
google

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120

In [96]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [97]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [98]:
df1.count()

Company    6
Person     6
Sales      6
dtype: int64

In [99]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [100]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [101]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [102]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [103]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [105]:
df1['Company'].value_counts()

FB      2
GOOG    2
MSFT    2
Name: Company, dtype: int64

In [111]:
new_data = df1[((df1['Company'] == 'GOOG') | (df1['Company'] == 'FB'))]

In [112]:
new_data

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
4      FB     Carl    243
5      FB    Sarah    350

In [113]:
new_data.count()

Company    4
Person     4
Sales      4
dtype: int64

## concatination

In [114]:
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
},index=[0,1,2,3])

In [115]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [116]:
df2 = pd.DataFrame({
    'A':['A4','A5','A6','A7'],
    'B':['B4','B5','B6','B7'],
    'C':['C4','C5','C6','C7'],
    'D':['D4','D5','D6','D7']
},index=[4,5,6,7])

In [117]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [118]:
df3 = pd.DataFrame({
    'A':['A8','A9','A10','A11'],
    'B':['B8','B9','B10','B11'],
    'C':['C8','C9','C10','C11'],
    'D':['D8','D9','D10','D11']
},index=[8,9,10,11])

In [119]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [120]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [121]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [122]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [123]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [124]:
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
},index=[0,1,2,3])


df2 = pd.DataFrame({
    'A':['A4','A5','A6','A7'],
    'B':['B4','B5','B6','B7'],
    'C':['C4','C5','C6','C7'],
    'D':['D4','D5','D6','D7']
},index=[0,1,2,3])

In [126]:
df3 = pd.concat([df1,df2])

In [127]:
df3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [128]:
df3.index

Int64Index([0, 1, 2, 3, 0, 1, 2, 3], dtype='int64')

In [137]:
df3.iloc[4]

A    A0
B    B0
C    C0
D    D0
Name: 0, dtype: object

In [138]:
df3.loc[0]

    A   B   C   D
0  A0  B0  C0  D0
0  A4  B4  C4  D4

In [145]:
left = pd.DataFrame({
    'Key' : ['K0','K1','K2','K3'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
})

In [146]:
left

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [150]:
right = pd.DataFrame({
    'Key' : ['K0','K1','K4','K5'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
})

In [151]:
right

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K4  C2  D2
3  K5  C3  D3

<!-- <img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/Visual_SQL_JOINS_orig.jpg" width="500" height="500"> -->

In [153]:
pd.merge(left,right,how='left',on='Key')

  Key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3  NaN  NaN

In [154]:
pd.merge(left,right,how='right',on='Key')

  Key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K4  NaN  NaN  C2  D2
3  K5  NaN  NaN  C3  D3

In [155]:
left = pd.DataFrame({
    'A' : ['K0','K1','K2','K3'],
    'E':['A0','A1','A2','A3'],
    'F':['B0','B1','B2','B3']
})

right = pd.DataFrame({
    'J' : ['K0','K1','K4','K5'],
    'K':['C0','C1','C2','C3'],
    'L':['D0','D1','D2','D3']
})

In [156]:
left

    A   E   F
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [157]:
right

    J   K   L
0  K0  C0  D0
1  K1  C1  D1
2  K4  C2  D2
3  K5  C3  D3

In [162]:
left.join(right)

    A   E   F   J   K   L
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K4  C2  D2
3  K3  A3  B3  K5  C3  D3

In [164]:
left.join(right)

    A   E   F   J   K   L
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K4  C2  D2
3  K3  A3  B3  K5  C3  D3

In [171]:
l1 = pd.DataFrame({
    'A' : ['A0','A1','A2'],
    'B' : ['B0','B1','B2']
},index=['K0','K1','K3'])

In [166]:
l1

     A   B
K0  A0  B0
K2  A1  B1
K3  A2  B2

In [172]:
l2 = pd.DataFrame({
    'C' : ['C0','C1','C2'],
    'D' : ['D0','D1','D2']
},index=['K0','K2','K3'])

In [173]:
l1

     A   B
K0  A0  B0
K1  A1  B1
K3  A2  B2

In [174]:
l2

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [175]:
l1.join(l2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K3  A2  B2   C2   D2

In [176]:
l1.join(l2,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K3  A2  B2  C2  D2

In [177]:
l1.join(l2,how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K3  A2  B2   C2   D2

In [178]:
l1.join(l2,how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2  NaN  NaN  C1  D1
K3   A2   B2  C2  D2